In [1]:
import pandas as pd

In [3]:
data = pd.read_table("http://bit.ly/chiporders")

In [4]:
print(data.head())

   order_id  quantity                              item_name  \
0         1         1           Chips and Fresh Tomato Salsa
1         1         1                                   Izze
2         1         1                       Nantucket Nectar
3         1         1  Chips and Tomatillo-Green Chili Salsa
4         2         2                           Chicken Bowl

                                  choice_description item_price
0                                                NaN     $2.39
1                                       [Clementine]     $3.39
2                                            [Apple]     $3.39
3                                                NaN     $2.39
4  [Tomatillo-Red Chili Salsa (Hot), [Black Beans...    $16.98

In [5]:
data.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [11]:
columns = ["user id", "gender", "occupation", "zip code"]
data2 =pd.read_table("http://bit.ly/movieusers", sep = "|", header = None, names = columns)

In [12]:
data2.head()

   user id gender  occupation zip code
1       24      M  technician    85711
2       53      F       other    94043
3       23      M      writer    32067
4       24      M  technician    43537
5       33      F       other    15213

In [13]:
# skiprows and skipfooter can be used to skip some lines if necessary

In [15]:
ufo = pd.read_csv("http://bit.ly/uforeports")

In [16]:
# read_table takes tabs as its default seperator
# read_csv takes comma as its default seperator
type(ufo)

pandas.core.frame.DataFrame

In [17]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [18]:
ufo["City"]

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
5                 Valley City
6                 Crater Lake
7                        Alma
8                     Eklutna
9                     Hubbard
10                    Fontana
11                   Waterloo
12                     Belton
13                     Keokuk
14                  Ludington
15                Forest Home
16                Los Angeles
17                  Hapeville
18                     Oneida
19                 Bering Sea
20                   Nebraska
21                        NaN
22                        NaN
23                  Owensboro
24                 Wilderness
25                  San Diego
26                 Wilderness
27                     Clovis
28                 Los Alamos
29               Ft. Duschene
                 ...
18211                 Holyoke
18212                  Carson
18213                Pasadena
18214                  Austin
18215                El Campo
18216            Garden Grove
18217           Berthoud Pass
18218              Sisterdale
18219            Garden Grove
18220             Shasta Lake
18221                Franklin
18222          Albrightsville
18223              Greenville
18224                 Eufaula
18225             Simi Valley
18226           San Francisco
18227           San Francisco
18228              Kingsville
18229                 Chicago
18230             Pismo Beach
18231             Pismo Beach
18232                    Lodi
18233               Anchorage
18234                Capitola
18235          Fountain Hills
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [19]:
type(ufo["City"])

pandas.core.series.Series

In [122]:
ufo.City

AttributeError: 'DataFrame' object has no attribute 'City'

In [24]:
# if there is a space in the name, dot notation doesnt work. you have to
# do this instead:
ufo["Colors Reported"]

0           NaN
1           NaN
2           NaN
3           NaN
4           NaN
5           NaN
6           NaN
7           NaN
8           NaN
9           NaN
10          NaN
11          NaN
12          RED
13          NaN
14          NaN
15          NaN
16          NaN
17          NaN
18          NaN
19          RED
20          NaN
21          NaN
22          NaN
23          NaN
24          NaN
25          NaN
26          NaN
27          NaN
28          NaN
29          NaN
          ...
18211       NaN
18212       NaN
18213     GREEN
18214       NaN
18215       NaN
18216    ORANGE
18217       NaN
18218       NaN
18219       NaN
18220      BLUE
18221       NaN
18222       NaN
18223       NaN
18224       NaN
18225       NaN
18226       NaN
18227       NaN
18228       NaN
18229       NaN
18230       NaN
18231       NaN
18232       NaN
18233       RED
18234       NaN
18235       NaN
18236       NaN
18237       NaN
18238       NaN
18239       RED
18240       NaN
Name: Colors Reported, Length: 18241, dtype: object

In [28]:
# dot notation is tricky, bracket notation is safer

In [29]:
"ab" + "cd"

'abcd'

In [35]:
ufo.Location = ufo.City + " " + ufo.State

In [36]:
ufo.Location

0                      Ithaca NY
1                 Willingboro NJ
2                     Holyoke CO
3                     Abilene KS
4        New York Worlds Fair NY
5                 Valley City ND
6                 Crater Lake CA
7                        Alma MI
8                     Eklutna AK
9                     Hubbard OR
10                    Fontana CA
11                   Waterloo AL
12                     Belton SC
13                     Keokuk IA
14                  Ludington MI
15                Forest Home CA
16                Los Angeles CA
17                  Hapeville GA
18                     Oneida TN
19                 Bering Sea AK
20                   Nebraska NE
21                           NaN
22                           NaN
23                  Owensboro KY
24                 Wilderness WV
25                  San Diego CA
26                 Wilderness WV
27                     Clovis NM
28                 Los Alamos NM
29               Ft. Duschene UT
                  ...
18211                 Holyoke MA
18212                  Carson CA
18213                Pasadena CA
18214                  Austin TX
18215                El Campo TX
18216            Garden Grove CA
18217           Berthoud Pass CO
18218              Sisterdale TX
18219            Garden Grove CA
18220             Shasta Lake CA
18221                Franklin NH
18222          Albrightsville PA
18223              Greenville SC
18224                 Eufaula OK
18225             Simi Valley CA
18226           San Francisco CA
18227           San Francisco CA
18228              Kingsville TX
18229                 Chicago IL
18230             Pismo Beach CA
18231             Pismo Beach CA
18232                    Lodi WI
18233               Anchorage AK
18234                Capitola CA
18235          Fountain Hills AZ
18236              Grant Park IL
18237             Spirit Lake IA
18238             Eagle River WI
18239             Eagle River WI
18240                    Ybor FL
Length: 18241, dtype: object

In [37]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [38]:
ufo["Location"] = ufo.City + " " + ufo.State

In [39]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca NY
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro NJ
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke CO
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,Abilene KS
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,New York Worlds Fair NY

In [42]:
movies = pd.read_csv("http://bit.ly/imdbratings")

In [43]:
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [44]:
movies.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [45]:
movies.shape

(979, 6)

In [46]:
movies.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [47]:
type(movies)

pandas.core.frame.DataFrame

In [48]:
# methods have pharantesis, attiributes dont.

In [54]:
movies.describe(include=["int64"])

         duration
count  979.000000
mean   120.979571
std     26.218010
min     64.000000
25%    102.000000
50%    117.000000
75%    134.000000
max    242.000000

In [55]:
movies.describe(include=["object"])

,title,content_rating,genre,actors_list
count,979,976,979,979
unique,975,12,16,969
top,True Grit,R,Drama,"[u'Daniel Radcliffe', u'Emma Watson', u'Rupert..."
freq,2,460,278,6

In [56]:
# if you couldnt remember the arguements of a method, hit shift+tab inside
# the paranthesis and it will show you. hit multiple times for explanations
movies.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [57]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca NY
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro NJ
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke CO
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,Abilene KS
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,New York Worlds Fair NY

In [58]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time',
       'Location'],
      dtype='object')

In [63]:
# renaming columns
ufo.rename(columns = {"Colors Reported":"Colors_Reported",
                     "Shape Reported":"Shape_Reported"}, inplace=True)

In [64]:
ufo.columns

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time',
       'Location'],
      dtype='object')

In [91]:
ufo_cols = ["city", "colors reported", "shape reported", "state", "time",
           "location"]
ufo.columns = ufo_cols

In [103]:
ufo.columns

Index(['city', 'colors_reported', 'shape_reported', 'state', 'time',
       'location'],
      dtype='object')

In [104]:
ufo = pd.read_csv("http://bit.ly/uforeports", names=ufo_cols, header=None)

In [105]:
ufo.columns

Index(['city', 'colors reported', 'shape reported', 'state', 'time',
       'location'],
      dtype='object')

In [106]:
ufo.head()

,city,colors reported,shape reported,state,time,location
0,City,Colors Reported,Shape Reported,State,Time,NaN
1,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,NaN
2,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,NaN
3,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,NaN
4,Abilene,NaN,DISK,KS,6/1/1931 13:00,NaN

In [107]:
ufo.columns = ufo.columns.str.replace(" ","_")

In [108]:
ufo.columns

Index(['city', 'colors_reported', 'shape_reported', 'state', 'time',
       'location'],
      dtype='object')

In [109]:
# removing columns
ufo.drop("location", axis=1, inplace=True)

In [110]:
ufo.head()

          city  colors_reported  shape_reported  state             time
0         City  Colors Reported  Shape Reported  State             Time
1       Ithaca              NaN        TRIANGLE     NY   6/1/1930 22:00
2  Willingboro              NaN           OTHER     NJ  6/30/1930 20:00
3      Holyoke              NaN            OVAL     CO  2/15/1931 14:00
4      Abilene              NaN            DISK     KS   6/1/1931 13:00

In [116]:
ufo["location"]= ufo.city + " " + ufo.state

In [117]:
ufo.head()

,city,colors_reported,shape_reported,state,time,location
0,City,Colors Reported,Shape Reported,State,Time,City State
1,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca NY
2,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro NJ
3,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke CO
4,Abilene,NaN,DISK,KS,6/1/1931 13:00,Abilene KS

In [118]:
ufo.head()

,city,colors_reported,shape_reported,state,time,location
0,City,Colors Reported,Shape Reported,State,Time,City State
1,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca NY
2,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro NJ
3,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke CO
4,Abilene,NaN,DISK,KS,6/1/1931 13:00,Abilene KS

In [119]:
ufo.drop(["city", "state"], axis=1, inplace=True)
ufo.head()

   colors_reported  shape_reported             time        location
0  Colors Reported  Shape Reported             Time      City State
1              NaN        TRIANGLE   6/1/1930 22:00       Ithaca NY
2              NaN           OTHER  6/30/1930 20:00  Willingboro NJ
3              NaN            OVAL  2/15/1931 14:00      Holyoke CO
4              NaN            DISK   6/1/1931 13:00      Abilene KS

In [120]:
ufo.drop(0, axis=0, inplace=True)

In [121]:
ufo.head()

  colors_reported shape_reported             time                 location
1             NaN       TRIANGLE   6/1/1930 22:00                Ithaca NY
2             NaN          OTHER  6/30/1930 20:00           Willingboro NJ
3             NaN           OVAL  2/15/1931 14:00               Holyoke CO
4             NaN           DISK   6/1/1931 13:00               Abilene KS
5             NaN          LIGHT  4/18/1933 19:00  New York Worlds Fair NY